Repository: Netsanet-dev/inventory_flutter_app
Catalog: lib/l10n/intl_*.arb
Languages: am

# setting
source: ቅንብር
am: Setting

source: Rental Details
am: የኪራይ ዝርዝሮች

source: Start Date
am: የመጀመሪያ ቀን

# startDateRequired
source: Start Date is required
am: የመጀመሪያ ቀን ያስፈልጋል

source: End Date
am: የማብቂያ ቀን

# endDateRequired
source: End Date is required
am: የማብቂያ ቀን ያስፈልጋል

source: Search Purchased Items
am: የተገዙ እቃዎችን ፈልግ

# selectPurchaseItem
source: Please select a purchase item
am: እባክዎ የተገዛ እቃ ይምረጡ

source: Customer ID
am: የደንበኛ መለያ

# customerIdRequired
source: Customer ID is required
am: የደንበኛ መለያ ያስፈልጋል

source: Rental Fee
am: የኪራይ ክፍያ

# rentalFeeRequired
source: Rental Fee is required
am: የኪራይ ክፍያ ያስፈልጋል

# validRentalFee
source: Please enter a valid rental fee
am: እባክዎ ተገቢ የኪራይ ክፍያ ያስገቡ

source: Rent Quantity
am: የኪራይ ብዛት

# rentQuantityRequired
source: Rent Quantity is required
am: የኪራይ ብዛት ያስፈልጋል

# validQuantity
source: Please enter a valid quantity
am: እባክዎ ተገቢ ብዛት ያስገቡ

source: Deposit
am: ተቀማጭ ገንዘብ

# depositRequired
source: Deposit is required
am: ተቀማጭ ገንዘብ ያስፈልጋል

# validDeposit
source: Please enter a valid deposit
am: እባክዎ ተገቢ ተቀማጭ ገንዘብ ያስገቡ

source: Rental Status
am: የኪራይ ሁኔታ

# rentalStatusRequired
source: Rental Status is required
am: የኪራይ ሁኔታ ያስፈልጋል

source: Show Additional Fields
am: ተጨማሪ መስኮችን አሳይ

source: Item SKU
am: የእቃ ኤስኬዩ

source: Image Path
am: የምስል መንገድ

source: Add Rental
am: ኪራይ ጨምር

source: Edit Rental
am: ኪራይ አርትዕ

source: Cost
am: ወጪ

source: Disposal Details
am: የመጣል ዝርዝሮች

source: Disposal Date
am: የመጣል ቀን

# disposalDateRequired
source: Disposal Date is required
am: የመጣል ቀን ያስፈልጋል

# quantityRequired
source: Quantity is required
am: ብዛት ያስፈልጋል

source: Disposal Reason
am: የመጣል ምክንያት

# disposalReasonRequired
source: Disposal Reason is required
am: የመጣል ምክንያት ያስፈልጋል

source: Disposal Method
am: የመጣል ዘዴ

# disposalMethodRequired
source: Disposal Method is required
am: የመጣል ዘዴ ያስፈልጋል

source: Original Item Cost
am: የመጀመሪያ እቃ ወጪ

# originalItemCostRequired
source: Original Item Cost is required
am: የመጀመሪያ እቃ ወጪ ያስፈልጋል

# validOriginalItemCost
source: Please enter a valid original item cost
am: እባክዎ ተገቢ የመጀመሪያ እቃ ወጪ ያስገቡ

source: Stock Location
am: የእቃ ማከማቻ ቦታ

source: Expense Description
am: የወጪ መግለጫ

source: Expense ID
am: የወጪ መለያ

source: Disposal Expense Amount
am: የመጣል ወጪ መጠን

# validDisposalExpenseAmount
source: Please enter a valid disposal expense amount
am: እባክዎ ተገቢ የመጣል ወጪ መጠን ያስገቡ

source: Processed By Staff ID
am: በሰራተኛ መለያ የተሰራ

source: Add Disposal
am: መጣል ጨምር

source: Edit Disposal
am: መጣል አርትዕ

source: Inventory App
am: ኢንቬንተሪ አፕሊኬሽን
