Repository: Netsanet-dev/inventory_flutter_app
Catalog: lib/l10n/intl_*.arb
Languages: am

source: Settings
am: ቅንብሮች

source: Language
am: ቋንቋ

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Date
am: ቀን

source: Dashboard
am: ዳሽቦርድ

source: Owner Name
am: ባለቤት ስም

source: Shop Name
am: ሱቅ ስም

source: Save
am: አስቀምጥ

source: Not Set
am: አልተዘጋጀም

source: Gallery
am: ጋለሪ

source: Assets
am: ንብረቶች

source: Select Logo Source
am: የሎጎ ምንጭ ምረጥ

source: Reconciliation Threshold
am: የማስታረቅ ገደብ

source: Inventory Alert Level
am: የእቃ ማንቂያ ደረጃ

source: Tax Rate
am: የግብር መጠን

source: Logo
am: ሎጎ

source: Ana Safety Shop
am: አና ደህንነት ሱቅ

# initialSetupMessage
source: Please provide your name and shop details to continue.
am: እባክዎ ስምዎን እና የሱቅ ዝርዝሮችን ያቅርቡ።

# enterOwnerName
source: Enter your name
am: ስምዎን ያስገቡ

source: Enter shop name
am: የሱቅ ስም ያስገቡ

source: Success
am: ስኬት

source: Error
am: ስህተት

source: Setup completed
am: ቅንብር ተጠናቅቋል

source: Failed to save setup
am: ቅንብር ማስቀመጥ አልተሳካም

# ownerNameAndShopName
source: Owner Name and Shop Name are required
am: የባለቤት ስም እና የሱቅ ስም ያስፈልጋሉ

source: Enter {field}
am: {field} ያስገቡ

source: Owner name updated
am: የባለቤት ስም ተዘምኗል

source: Failed to update owner name
am: የባለቤት ስም ማዘመን አልተሳካም

source: Owner name cannot be empty
am: የባለቤት ስም ባዶ መሆን አይችልም

source: Shop name updated
am: የሱቅ ስም ተዘምኗል

source: Failed to update shop name
am: የሱቅ ስም ማዘመን አልተሳካም

source: Shop name cannot be empty
am: የሱቅ ስም ባዶ መሆን አይችልም

source: Reconciliation threshold updated
am: የማስታረቅ ገደብ ተዘምኗል

source: Failed to update threshold
am: ገደብ ማዘመን አልተሳካም

# thresholdMustBePositive
source: Threshold must be a positive number
am: ገደብ አወንታዊ ቁጥር መሆን አለበት

source: Inventory alert level updated
am: የእቃ ማንቂያ ደረጃ ተዘምኗል

source: Failed to update alert level
am: የማንቂያ ደረጃ ማዘመን አልተሳካም

source: Alert level must be non-negative
am: የማንቂያ ደረጃ አሉታዊ መሆን የለበትም

source: Tax rate updated
am: የግብር መጠን ተዘምኗል

# failedToUpdateTaxRate
source: Failed to update tax
am: የግብር መጠን ማዘመን አልተሳካም

source: Tax rate must be non-negative
am: የግብር መጠን አሉታዊ መሆን የለበትም፡፡

source: Logo updated from gallery
am: ሎጎ ከጋለሪ ተዘምኗል

source: Logo updated from assets
am: ሎጎ ከንብረቶች ተዘምኗል

source: Failed to update logo
am: ሎጎ ማዘመን አልተሳካም

source: Theme
am: ገፅታ

source: Invalid
am: ልክ ያልሆነ

# ownerNameAndShopNameRequired
source: Owner and Shop names are required
am: የሱቅ እና የሱቅ ባለቤት ስም ያስፈልጋል

source: Accounts Overview
am: የመለያዎች አጠቃላይ እይታ

source: Accounts
am: መለያዎች

source: Reports
am: ሪፖርቶች

source: Refresh Accounts
am: መለያዎችን አድስ

source: Create Account
am: መለያ ፍጠር

source: Search Accounts
am: መለያዎችን ፈልግ

# no_accounts_found
source: No accounts match your search
am: ፍለጋህን የሚዛመዱ መለያዎች የሉም

source: Retry
am: እንደገና ሞክር

source: Balance Sheet
am: የሂሳብ ሚዛን

source: Income Statement
am: የገቢ መግለጫ

source: Cash Flow
am: የገንዘብ ፍሰት

source: Category Summary
am: የምድብ ማጠቃለያ

source: Type Summary
am: የአይነት ማጠቃለያ

source: Trial Balance
am: የሙከራ ሚዛን

source: Liabilities
am: እዳዎች

source: Equity
am: ፍትሃዊነት

source: Revenue
am: ገቢ

source: Expenses
am: ወጪዎች

source: Net Income
am: የተጣራ ገቢ

source: Operating
am: ኦፕሬሽን

source: Investing
am: ኢንቨስትመንት

source: Financing
am: ፋይናንሲንግ

source: Net Change
am: የተጣራ ለውጥ

source: Account Name
am: የመለያ ስም

source: Account Type
am: የመለያ አይነት

source: Account Category
am: የመለያ ምድብ

source: Balance
am: ሚዛን

source: Chart Number
am: የገበታ ቁጥር

source: ID
am: መለያ

source: Active
am: ንቁ

source: Notes
am: ማስታወሻዎች

source: Notes (Optional)
am: ማስታወሻዎች (አማራጭ)

source: Chart
am: ገበታ

source: Type
am: አይነት

source: Yes
am: አዎ

source: No
am: አይ

source: Edit
am: አስተካክል

source: Deactivate
am: ለጊዜው አጥፋ

source: Create
am: ፍጠር

source: Close
am: ዝጋ

# name_required
source: Name is required
am: ስም ያስፈልጋል

# type_required
source: Please select an account type
am: እባክህ የመለያ አይነት ምረጥ

# category_required
source: Please select an account category
am: እባክህ የመለያ ምድብ ምረጥ

# balance_required
source: Balance is required
am: ሚዛን ያስፈልጋል

# invalid_number
source: Enter a valid number
am: ትክክለኛ ቁጥር አስገባ

# error_title
source: Error
am: ስህተት

# success_title
source: Success
am: ስኬት

# error_empty_name
source: Account name cannot be empty
am: የመለያ ስም ባዶ ሊሆን አይችልም

# error_empty_id
source: Account ID cannot be empty
am: የመለያ መለያ ባዶ ሊሆን አይችልም

# error_create_account
source: Failed to create account: {error}
am: መለያ መፍጠር አልተሳካም: {error}

# error_fetch_accounts
source: Failed to fetch accounts: {error}
am: መለዪዎችን ማግኘት አልተሳካም: {error}

# error_filter_accounts
source: Failed to filter accounts: {error}
am: መለዪዎችን ማጣራት አልተሳካም: {error}

# error_update_reports
source: Failed to update financial reports: {error}
am: የፋይናንስ ሪፖርቶችን ማዘመን አልተሳካም: {error}

# error_fetch_account
source: Failed to fetch account: {error}
am: መለዪ ማግኘት አልተሳካም: {error}

# error_fetch_account_by_name
source: Failed to fetch account by name: {error}
am: መለዪን በስም ማግኘት አልተሳካም: {error}

# error_update_account
source: Failed to update account: {error}
am: መለዪን ማዘመን አልተሳካም: {error}

# error_deactivate_account
source: Failed to deactivate account: {error}
am: መለዪን ማቦዘን አልተሳካም: {error}

source: Created via UI
am: በተጠቃሚ በይነገጽ ተፈጥሯል

# success_account_created
source: Account {name} created successfully
am: መለዪ {name} በተሳካ ሁኔታ ተፈጥሯል

# success_account_updated
source: Account {name} updated successfully
am: መለዪ {name} በተሳካ ሁኔታ ተዘምኗል

# success_account_deactivated
source: Account {id} deactivated successfully
am: መለዪ {id} በተሳካ ሁኔታ ተቦዝኗል

source: Edit Account
am: መለያ አስተካክል

source: Snapshot Date
am: የቅንጥብ ቀን

source: Total Balance
am: ጠቅላላ ቀሪ

source: No snapshots found
am: ምንም ቅንጥቦች አልተገኙም

# error_fetching_snapshots
source: Failed to fetch snapshots: {error}
am: ቅንጥቦችን ማምግኘት አልተሳካም: {error}

source: Snapshots
am: ቅንጥቦች

# purchases_tab
source: Purchases
am: ግዢዎች

# error_fetching_purchases
source: Failed to fetch purchases: {error}
am: ግዢዎችን ማምግኘት አልተሳካም: {error}

source: No purchases found
am: ምንም ግዢዎች አልተገኙም

source: Cash
am: ጥፍ

source: Credit
am: ብድር

# purchase_from
source: Purchase from {name}
am: ከ{name} ግዢ

source: Total Amount
am: ጠቅላላ መጠን

source: Payment Method
am: የክፍያ ዘዴ

source: Items
am: እቃዎች

source: Unit Cost
am: የንጥል ዋጋ

source: Add Category
am: ምድብ ጨምር

source: Edit Category
am: ምድብ አስተካክል

source: Tap to Pick Image
am: ምስል ለመምረጥ መታ አድርግ

source: Group
am: ቡድን

source: Subgroup (Optional)
am: ንዑስ ቡድን (አማራጭ)

source: Subgroup 2 (Optional)
am: ንዑስ ቡድን 2 (አማራጭ)

source: Priority
am: ቅድሚያ

# enterValidNumber
source: Enter a valid number
am: ትክክለኛ ቁጥር አስገባ

# deleteCategoryConfirmation
source: Are you sure you want to delete this category?
am: ይህን ምድብ መሰረዝ እንደሚፈልጉ እርግጠኛ ነዎት?

source: Delete
am: ሰርዝ

source: Stock Categories
am: የክምችት ምድቦች

source: No categories found
am: ምንም ምድቦች አልተገኙም

source: Status Updated
am: ሁኔታ ተዘምኗል

source: Category added
am: ምድብ ታክሏል

source: Category updated
am: ምድብ ተዘምኗል

source: Previous
am: ቀዳሚ

source: Next
am: ቀጣይ

source: Page
am: ገፅ

source: Inactive
am: እንቅስቃሴ-አልባ

# category_true
source: Category activated
am: ምድብ ንቁ ተደርጓል

# category_false
source: Category deactivated
am: ምድብ ለጊዜው ንቁ አልሆነም

# no_expenses
source: No expenses found
am: ምንም ወጪዎች አልተገኙም

source: Confirm Delete
am: ስረዛን አረጋግጥ

# delete_expense
source: Delete expense '{category}'?
am: ወጪን '{category}' ሰርዝ?

# amount
source: Amount: ${value}
am: መጠን: ${value}

# payment
source: Payment: {method}
am: ክፍያ: {method}

# expense_date
source: Date: {value}
am: ቀን: {value}

source: Edit Expense
am: ወጪን አስተካክል

source: Add Expense
am: ወጪ ጨምር

source: Required
am: አስፈላጊ

source: Must be positive
am: አዎንታዊ መሆን አለበት

source: Select date
am: ቀን ምረጥ

source: Show Additional Fields
am: ተጨማሪ መስኮችን አሳይ

source: Tax
am: ግብር

source: Must be non-negative
am: አሉታዊ መሆን የለበትም

source: Vendor
am: ሻጭ

source: Image Receipt URL
am: የደረሰኝ ምስል URL

source: Receipt ID
am: የደረሰኝ መለያ

source: Is Prepaid
am: ቅድመ ክፍያ ነው

source: From Inventory
am: ከክምችት

source: Update
am: አዘምን

source: Add
am: ጨምር

# date_required
source: Please select a date
am: እባክዎ ቀን ይምረጡ

source: Add Purchase
am: ግዢ መዝግብ

source: Edit Purchase
am: ግዢ አስተካክል

# category_shoes
source: Shoes
am: ጫማ

# subcategory_safety_shoes
source: Safety Shoes
am: ሴፍቲ ጫማ

# subcategory_keskes
source: keskes
am: ከስክስ

# subcategory_boots
source: Boots
am: ቡትስ ጫማ

# subcategory_work_shoes
source: Work Shoes
am: ጉርድ ጫማ

# subcategory_womens_shoes
source: Women's Shoes
am: የሴቶች ጫማ

# subcategory_local_shoes
source: Local Shoes
am: ቦቲ

# brand_with_extra
source: with extra
am: ቅጥል ያለው

# brand_lion
source: Lion
am: አንበሳ ጫማ

# brand_black_nile
source: Black Nile
am: ጥቁር አባይ

# brand_ramsey
source: Ramsey
am: ራምሴ

# brand_can
source: Can
am: ካን

# brand_peacock
source: Peacock
am: ፒኮክ

# brand_sheba
source: Sheba
am: ሼባ

# brand_jogger
source: Jogger
am: ጆገር

# brand_rock_lander
source: Rock Lander
am: ሮክ ላንደር

# brand_every_safe
source: Every Safe
am: ኤቭሪ ሴፍ

# brand_cat
source: Cat
am: ካት

# brand_heckel
source: Heckel
am: ሄኬል

# brand_global
source: Global
am: ግሎባል

# brand_patterned
source: Patterned
am: ፓተርንድ

# brand_ranger
source: Ranger
am: ሬንጀር

# brand_delta
source: Delta
am: ዴልታ

# brand_spiked
source: Spiked
am: እሾክ ያለው

# brand_dalcha_timber
source: Dalcha Timber
am: ዳልቻ ቲምበር

# brand_swat_timber
source: Swat Timber
am: ስዋት ቲምበር

# brand_kangaroo
source: Kangaroo
am: ካንጋሮ

# brand_salam
source: Salam
am: ሰላም

# brand_abajifar
source: Abajifar
am: አባጅፋር

# brand_safety
source: Safety
am: ሴፍቲ

# brand_work
source: Work
am: ጉርድ

# category_tuta
source: Tuta
am: ቱታ

# subcategory_safety_tuta
source: Safety Tuta
am: ሴፍቲ ቱታ

# brand_coat
source: Coat
am: ኮት

# brand_pants
source: Pants
am: ሱሪ

# brand_full
source: Full
am: ሙሉ ቱታ

# brand_airline
source: Airline
am: ኤርላይን ቱታ

# subcategory_khaki
source: Khaki
am: ካኪ

# brand_dalcha
source: Dalcha
am: ዳልቻ

# subcategory_printed
source: Printed
am: ፅሁፍ ያለው

# brand_khaki
source: Khaki
am: ካኪ

# brand_tetran
source: Tetran
am: ቴትራን

# brand_crocs
source: Crocs
am: ክሮክስ

# subcategory_teteran
source: Teteran
am: ቴቴራን

# brand_teteran
source: Teteran
am: ቴቴራን

# subcategory_manchini
source: Manchini
am: ማንቺኒ

# brand_manchini
source: Manchini
am: ማንቺኒ

# subcategory_ventilated
source: Ventilated
am: ማንገቻ ያለው

# brand_ventilated
source: Ventilated
am: ማንገቻ ያለው

# category_gown
source: Gown
am: ጋዎን

# subcategory_hospitality_gown
source: Hospitality Gown
am: የመስተንግዶ ጋዎን

# brand_hospitality_gown
source: Hospitality Gown
am: የመስተንግዶ ጋዎን

# category_gloves
source: Gloves
am: ጓንት

# subcategory_leather_gloves
source: Leather Gloves
am: ሌዘር ጓንት

# brand_leather_gloves
source: Leather Gloves
am: ሌዘር ጓንት

# subcategory_laser_gloves
source: Laser Gloves
am: የቆዳ ጓንት

# brand_laser_gloves
source: Laser Gloves
am: የቆዳ ጓንት

# subcategory_knitted_gloves
source: Knitted Gloves
am: ሹራብ ጓንት

# brand_knitted_gloves
source: Knitted Gloves
am: ሹራብ ጓንት

# subcategory_plastic_gloves
source: Plastic Gloves
am: ፕላስቲክ ጓንት

# brand_plastic_gloves
source: Plastic Gloves
am: ፕላስቲክ ጓንት

# category_coat
source: Coat
am: ካፖርት

# subcategory_wool_coat
source: Wool Coat
am: የሱፍ ካፖርት

# brand_wool_coat
source: Wool Coat
am: የሱፍ ካፖርት

# subcategory_fabric_coat
source: Fabric Coat
am: የጨርቅ ካፖርት

# brand_fabric_coat
source: Fabric Coat
am: የጨርቅ ካፖርት

# subcategory_local_coat
source: Local Coat
am: የሃገር ውስጥ ካፖርት

# brand_local_coat
source: Local Coat
am: ሃገር ውስጥ ካፖርት

# category_reflective
source: Reflective
am: አንፀባራቂ

# subcategory_imported
source: Imported
am: የውጭ

# brand_imported
source: Imported
am: የውጭ

# subcategory_local
source: Local
am: የሃገር ውስጥ

# brand_local
source: Local
am: የሃገር ውስጥ

# category_rainwear
source: Rainwear
am: የዝናብ ልብስ

# subcategory_coat_and_pants
source: Coat and Pants
am: ኮት እና ሱሪ

# brand_coat_and_pants
source: Coat and Pants
am: ኮት እና ሱሪ

# subcategory_full_rainwear
source: Full Rainwear
am: ሙሉ የዝናብ ልብስ

# brand_full_rainwear
source: Full Rainwear
am: ሙሉ የዝናብ ልብስ

# subcategory_thin_rainwear
source: Thin Rainwear
am: ስስ የዝናብ ልብስ

# brand_thin_rainwear
source: Thin Rainwear
am: ስስ የዝናብ ልብስ

# category_coat_and_pants
source: Coat and Pants
am: ኮት እና ሱሪ

# subcategory_reflective
source: Reflective
am: አንፀባራቂ ያለው

# brand_reflective
source: Reflective
am: አንፀባራቂ ያለው

# subcategory_match
source: Match
am: ማች

# brand_match
source: Match
am: ማች

# subcategory_shirt_and_pants
source: Shirt and Pants
am: ሸሚዝ እና ፓንት

# brand_shirt_and_pants
source: Shirt and Pants
am: ሸሚዝ እና ፓንት

# category_wallet
source: Wallet
am: ሽርጥ

# subcategory_deep
source: Deep
am: የሚጠለቅ

# brand_deep
source: Deep
am: የሚጠለቅ

# subcategory_front_and_back
source: Front and Back
am: ኋላ እና ፊት ያለው

# brand_front_and_back
source: Front and Back
am: ኋላ እና ፊት ያለው

# subcategory_with_coin_pocket
source: With Coin Pocket
am: ሳንቲም ቤት ያለው

# brand_with_coin_pocket
source: With Coin Pocket
am: ሳንቲም ቤት ያለው

# category_cap
source: Cap
am: ኮፍያ

# subcategory_kitchen_cap
source: Kitchen Cap
am: የወጥ ቤት ኮፍያ

# brand_with_net
source: With Net
am: ወንፊት ቤት ያለው

# brand_without_net
source: Without Net
am: ወንፊት ቤት የሌለው

# brand_chef_cap
source: Chef Cap
am: የሼፍ ኮፍያ

# subcategory_hat
source: Hat
am: ኮፍያ

# brand_selene
source: Selene
am: ሴሌን

# brand_fabric
source: Fabric
am: ፋብሪክ

# subcategory_helmet
source: Helmet
am: ሄልሜት

# brand_helmet
source: Helmet
am: ሄልሜት

# subcategory_normal_cap
source: Normal Cap
am: ኖርማል ኮፍያ

# brand_normal_cap
source: Normal Cap
am: ኖርማል ኮፍያ

# category_shirt
source: Shirt
am: ሸሚዝ

# subcategory_shirt
source: Shirt
am: ሸሚዝ

# brand_white
source: White
am: ነጭ

# brand_black
source: Black
am: ጥቁር

# brand_blue
source: Blue
am: ሰማያዊ

# category_mask
source: Mask
am: ማስክ

# subcategory_chemical_mask
source: Chemical Mask
am: ኬሚካል ማስክ

# brand_chemical_mask
source: Chemical Mask
am: ኬሚካል ማስክ

# subcategory_surgical_mask
source: Surgical Mask
am: ሰርጂካል ማስክ

# brand_surgical_mask
source: Surgical Mask
am: ሰርጂካል ማስክ

# subcategory_normal_mask
source: Normal Mask
am: ኖርማል ማስክ

# brand_normal_mask
source: Normal Mask
am: ኖርማል ማስክ

# category_jacket
source: Jacket
am: ጃኬት

# subcategory_safety_jacket
source: Safety Jacket
am: ሴፍቲ ጃኬት

# brand_safety_jacket
source: Safety Jacket
am: ሴፍቲ ጃኬት

# subcategory_reflective_jacket
source: Reflective Jacket
am: አንፀባራቂ ጃኬት

# brand_reflective_jacket
source: Reflective Jacket
am: አንፀባራቂ ጃኬት

# subcategory_normal_jacket
source: Normal Jacket
am: ኖርማል ጃኬት

# brand_normal_jacket
source: Normal Jacket
am: ኖርማል ጃኬት

# category_belt
source: Belt
am: ቀበቶ

# subcategory_leather_belt
source: Leather Belt
am: ሌዘር ቀበቶ

# brand_leather_belt
source: Leather Belt
am: ሌዘር ቀበቶ

# subcategory_canvas_belt
source: Canvas Belt
am: ሸራ ቀበቶ

# brand_canvas_belt
source: Canvas Belt
am: ሸራ ቀበቶ

# category_socks
source: Socks
am: ካልሲ

# subcategory_long_socks
source: Long Socks
am: ረጅም ካልሲ

# brand_long_socks
source: Long Socks
am: ረጅም ካልሲ

# subcategory_short_socks
source: Short Socks
am: አጭር ካልሲ

# brand_short_socks
source: Short Socks
am: አጭር ካልሲ

# category_glasses
source: Glasses
am: መነፅር

# subcategory_welding_glasses
source: Welding Glasses
am: የብየዳ መነፅር

# brand_welding_glasses
source: Welding Glasses
am: የብየዳ መነፅር

# subcategory_dust_glasses
source: Dust Glasses
am: የአቧራ መነፅር

# brand_dust_glasses
source: Dust Glasses
am: የአቧራ መነፅር

# subcategory_sunglasses
source: Sunglasses
am: የፀሃይ መነፅር

# brand_sunglasses
source: Sunglasses
am: የፀሃይ መነፅር

# itemColorRed
source: Red
am: ቀይ

# itemColorBlue
source: Blue
am: ሰማያዊ

# itemColorYellow
source: Yellow
am: ቢጫ

# itemColorBlack
source: Black
am: ጥቁር

# itemColorWhite
source: White
am: ነጭ

# itemColorGreen
source: Green
am: አረንጓዴ

# itemColorOrange
source: Orange
am: ብርቱካን

# itemColorBrown
source: Brown
am: ቡናማ

# itemColorGrey
source: Grey
am: ግራጫ

# itemColorPink
source: Pink
am: ሮዝ

# itemColorPurple
source: Purple
am: ሐምራዊ

# itemColorSilver
source: Silver
am: ብር

# itemColorGold
source: Gold
am: ወርቅ

# itemColorKaki
source: Khaki
am: ካኪ

# itemColorOther
source: Other
am: ሌላ

# paymentWithCash
source: Cash
am: በጥሬ ገንዘብ

# paymentWithCheck
source: Check book
am: በቼክ

# creditNoPayment
source: Credit
am: በብድር/በዕዳ

# paymentInKind
source: barter
am: በአይነት

# paymentWithBankTransfer
source: Bank Transfer
am: በባንክ ሂሳብ በመላክ

source: Purchase Items
am: የግዢ እቃዎች

source: Search
am: ፍለጋ

source: Filter Items
am: እቃዎችን አጣራ

source: Filters
am: ማጣሪያዎች

source: All
am: ሁሉም

source: Category
am: ምድብ

source: Subcategory
am: ንዑስ ምድብ

source: Subcategory 2
am: ንዑስ ምድብ 2

source: Color
am: ቀለም

source: Size
am: መጠን

# shoe_size
source: Shoes Size
am: የጫማ ቁጥር

source: Low Stock
am: ዝቅተኛ ክምችት

source: None
am: ምንም

source: Cancel
am: ሰርዝ

source: Done
am: ተጠናቀቀ

source: No items found.
am: ምንም እቃዎች አልተገኙም

source: Quantity
am: ብዛት

source: Sales Items
am: የሽያጭ እቃዎች

source: Unit
am: ክፍል

source: Product Name
am: የምርት ስም

source: Profitable Items
am: ትርፋማ እቃዎች

source: Unknown
am: ያልታወቀ

source: Purchases
am: ግዢዎች

source: Purchase Date
am: የግዢ ቀን

source: Show Additional Purchase Fields
am: ተጨማሪ የግዢ መስኮችን አሳይ

source: Invoice Number
am: የክፍያ መጠየቂያ ቁጥር

source: Vendor Name
am: የሻጭ ስም

source: Buy Tax
am: የግዢ ታክስ

source: Paid Amount
am: የተከፈለ መጠን

source: Cancel Add Item
am: ተራ መጨመርን መሰረዝ

source: Add Item
am: ተራ መጨመር

source: Cancel Add Expense
am: ወጪ መጨመርን መሰረዝ

# no_items
source: No items added
am: ምንም ተራዎች የሉ

# min_stock
source: Minimum Stock
am: ዝቅተኛ ክምችት

source: Discount
am: ቅናሽ

source: Item Tax
am: የተራ ታክስ

source: Stock Location
am: የክምችት ቦታ

# stock_ref
source: Stock Reference
am: የክምችት ማጣቀሻ

source: Image Receipt
am: የደረሰኝ ምስል

# payment_method_required
source: Payment Method is required
am: የክፍያ ዘዴ ያስፈልጋል

# quantity_required
source: Valid quantity required
am: ትክክለኛ ብዛት ያስፈልጋል

# unit_cost_required
source: Valid unit cost required
am: ትክክለኛ የአንድ ክፍል ዋጋ ያስፈልጋል

# color_required
source: Color is required
am: ቀለም ያስፈልጋል

# shoe_size_required
source: Valid shoe size required
am: ትክክለኛ የጫማ መጠን ያስፈልጋል

# size_required
source: Size is required
am: መጠን ያስፈልጋል

# amount_required
source: Valid amount required
am: ትክክለኛ መጠን ያስፈልጋል

# invalid_tax
source: Tax cannot be negative
am: ታክስ አሉታዊ ሊሆን አይችልም

# invalid_discount
source: Discount cannot be negative
am: ቅናሽ አሉታዊ ሊሆን አይችልም

# invalid_min_stock
source: Minimum stock cannot be negative
am: ዝቅተኛ ክምችት አሉታዊ ሊሆን አይችልም

# invalid_amount
source: Amount cannot be negative
am: መጠን አሉታዊ ሊሆን አይችልም

source: Please fill
am: እባክዎ ይሙሉ

# birr
source: ETB
am: ብር

# group_name_required
source: Group name is required
am: የቡድን ስም አስፈላጊ ነው

# priority_invalid
source: Priority must be a valid number
am: ቅድሚያ ትክክለኛ ቁጥር መሆን አለበት

# invalid_category_id
source: Invalid category ID for update
am: ለዝመና የማይሰራ የምድብ መለያ

# failed_save_category
source: Failed to save category: {error}
am: ምድብ ማስቀመጥ አልተሳካም: {error}

# date_future_invalid
source: Date cannot be in the future
am: ቀን ወደፊት መሆን አይችልም

# failed_update_expenses
source: Failed to update expenses date
am: የወጪዎች ቀን ማዘመን አልተሳካም

# failed_add_item
source: Failed to add item: {error}
am: እቃ መጨመር አልተሳካም: {error}

# unit_cost_positive
source: Unit cost must be positive
am: የክፍል ዋጋ አወንታዊ መሆን አለበት

# discount_positive
source: Discount must be positive
am: ቅናሽ አወንታዊ መሆን አለበት

# item_tax_positive
source: Item tax must be positive
am: የእቃ ግብር አወንታዊ መሆን አለበት

source: Item not found
am: እቃ አልተገኘም

# failed_update_item
source: Failed to update item: {error}
am: እቃ ማዘመን አልተሳካም: {error}

# failed_remove_item
source: Failed to remove item: {error}
am: እቃ መወገድ አልተሳካም: {error}

source: Sale
am: ሽያጭ

# amount_positive
source: Amount must be positive
am: መጠን አወንታዊ መሆን አለበት

# payment_method_not_none
source: Payment method cannot be none
am: የክፍያ ዘዴ ባዶ መሆን አይችልም

# tax_negative
source: Tax cannot be negative
am: ግብር አሉታዊ መሆን አይችልም

# failed_add_expense
source: Failed to add expense: {error}
am: ወጪ መጨመር አልተሳካም: {error}

source: Expense not found
am: ወጪ አልተገኘም

source: Form validation failed
am: የፎርም ማረጋገጫ አልተሳካም

# purchase_item_required
source: At least one purchase item is required
am: ቢያንስ አንድ የግዢ እቃ አስፈላጊ ነው

# purchase_payment_method_required
source: Purchase payment method is required
am: የግዢ ክፍያ ዘዴ አስፈላጊ ነው

# purchase_date_before_2000
source: Purchase date must be after the year 2000
am: የግዢ ቀን ከ2000 ዓ.ም. በኋላ መሆን አለበት

# buy_tax_negative
source: Buy tax cannot be negative
am: የግዢ ግብር አሉታዊ መሆን አይችልም

# paid_amount_negative
source: Paid amount cannot be negative
am: የተከፈለ መጠን አሉታዊ መሆን አይችልም

# failed_save_purchase
source: Failed to save purchase: {error}
am: ግዢ ማስቀመጥ አልተሳካም: {error}

# purchase_saved_success
source: Purchase saved successfully
am: ግዢ ተሳክቶ ተቀምጧል

source: Low Stock Alerts
am: ዝቅተኛ ክምችት ማንቂያዎች

source: Quick Actions
am: ፈጣን ተግባራት

source: Owner
am: ባለቤት

# welcome_owner
source: Welcome, {ownerName}
am: እንኳን ደህና መጡ, {ownerName}

# monitor_inventory
source: Monitor your inventory and finances
am: ክምችትዎን እና ፋይናንስዎን ይከታተሉ

source: Inventory
am: ክምችት

source: ETB
am: ብር

source: Sales Trend
am: የሽያጭ አዝማሚያ

source: Swap
am: ዕቃ መለዋወጥ

source: Disposal
am: የተወገደ ዕቃ

source: Name
am: ስም

# no_low_stock
source: No low stock items
am: ዝቅተኛ ክምችት ያላቸው እቃዎች የሉም

source: Stock
am: ክምችት

source: Phone Number
am: ስልክ ቁጥር

source: Shop Address
am: የሱቅ አድራሻ

source: TIN Number
am: ቲን ቁጥር

source: Reset
am: ወደ ነበረበት መልስ

source: Select Language
am: ቋንቋ ምረጥ

source: Select Theme
am: ገፅታ ምረጥ

source: Select Currency
am: የገንዘብ ምንዛሬ ምረጥ

# ownerNameEmpty
source: Owner name cannot be empty
am: የባለቤት ስም ባዶ መሆን አይችልም፡፡

# shopNameEmpty
source: Shop name cannot be empty
am: የሱቅ ስም ባዶ መሆን አይችልም፡፡

# phoneNumberInvalid
source: Phone number must be at least 10 characters
am: ስልክ ቁጥር አስር(10) ዲጂት መሆን አለበት

# tinNumberInvalid
source: TIN number must be at least 8 characters
am: ቲን ስምንት(8) ዲጂት እና ከዛ በላይ መሆን አለበት፡፡

# thresholdNegative
source: Reconciliation Threshold must be non-negative
am: የዕቃ ክምችት ማስታረቂያ ቁጥር አሉታዊ ቁጥር መሆን የለበትም፡፡

# inventoryNegative
source: Inventory Alert Level must be non-negative
am: የዕቃ ማንቂያ ቁጥር አሉታዊ ቁጥር መሆን የለበትም፡፡

# taxRateNegative
source: Tax rate must be non-negative
am: የግብር መጠን አሉታዊ ቁጥር መሆን የለበትም፡፡

source: New Field
am: አዲስ ፅሁፍ ማስገቢያ ቦታ

# newFieldInvalid
source: New field must be at least 5 characters
am: አዲስ ቦታ የፊደል መጠን ከአምስት መብለጥ አለበት፡፡

# add_sale
source: Add Sales
am: ሽያጭ መዝግብ

# edit_sale
source: Edit Sales
am: ሽያጭ አስተካክል

source: Total Quantity
am: አጠቃላይ ብዛት

source: Total Expense
am: አጠቃላይ ወጪ

# confirm_delete_expense
source: Are you sure you want to delete an expense?
am: እርግጠኛ ኖት ይህንን ወጪ ለማጥፋት ይፈልጋሉ?

# confirm_delete_sales
source: Are you sure you want to delete this sales?
am: እርግጠኛ ኖት ይህንን ሽያጭ ለማጥፋት ይፈልጋሉ?

# confirm_delete_purchases
source: Are you sure you want to delete this purchase?
am: እርግጠኛ ኖት ይህንን ግዢ ለማጥፋት ይፈልጋሉ?

source: Employee Expense
am: የሰራተኛ ወጪ

source: Guard Expense
am: የዘበኛ ወጪ

source: House Rent
am: የቤት ኪራይ ወጪ

# food
source: Food Expense
am: የምግብ ወጪ

# transportation
source: Transportation Expense
am: የትራንስፖርት ወጪ

# goodsTransport
source: Goods Transport Expense
am: የዕቃ ትራንስፖርት ወጪ

# festal
source: Plastic packaging Expense
am: የፌስታል ወጪ

# waste
source: Waste Expense
am: የቆሻሻ ወጪ

# packaging
source: Packaging Expense
am: የማሸጊያ ወጪ

# commission
source: Commission Expense
am: የኮሚሽን ወጪ

# militia
source: Militia Expense
am: የሚሊሻ ወጪ

# warehouse
source: Warehouse Expense
am: የመጋዘን ወጪ

source: Other
am: ሌላ

# current_amount
source: Price Amount
am: የገንዘብ መጠን

source: Tap to pick image
am: ፎቶ ለማስገባት ይህንን ይጫኑ

source: Take Photo
am: ፎቶ ያንሱ

source: Choose from gallery
am: ፎቶ ከፎቶ ማስቀመጫ ይምረጡ

# swapReasonColor
source: Color Swap
am: የቀለም ቅያሪ

# swapReasonSize
source: Size Swap
am: የመጠን ቅያሪ

# swapReasonBrand
source: Brand Swap
am: የብራንድ ቅያሪ

# itemConditionNew
source: New
am: አዲስ

# itemConditionUsed
source: Used
am: ጥቅም ላይ የዋለ

# itemConditionRefurbished
source: Refurbished
am: የተስተካከለ

# itemConditionDefective
source: Defective
am: ጉድለት ያለበት

# purchase
source: ግዢ
am: Purchase

# sales
source: ሽያጭ
am: Sales

# analytics
source: ሪፖርት
am: Analytics

# finance
source: ፋይናንስ
am: Finance

# expense
source: ወጪ
am: Expense
